In [1]:
import pandas as pd
from numpy.random import randn
import numpy as np

# Ainda no Pandas

In [2]:
np.random.seed(101)
dados = {
    'Empresas': ['Google', 'Apple', 'Microsoft', 'Facebook', 'Amazon', 'Google', 'Apple', 'Microsoft', 'Facebook', 'Amazon'],
    'Nome_vendedor': [ 'José', 'Maria', 'Carlos', 'José', 'Maria', 'Carlos', 'José', 'Maria', 'Carlos', 'Fabio'],
    'Valor_venda': [round((i+3)*2000, 2) for i in randn(10)],
    'Valor_imposto': [round((i+3)*500, 2) for i in randn(10)],
}

### Groupby
groupby('Coluna de agregação').METODO()

In [3]:
df_01 = pd.DataFrame(dados)
df_01

    Empresas Nome_vendedor  Valor_venda  Valor_imposto
0     Google          José     11413.70        1764.41
1      Apple         Maria      7256.27        1205.50
2  Microsoft        Carlos      7815.94        1594.35
3   Facebook          José      7007.65        1120.56
4     Amazon         Maria      7302.24        1033.38
5     Google        Carlos      5361.36        1977.53
6      Apple          José      4303.85        1595.40
7  Microsoft         Maria      7211.93        2489.38
8   Facebook        Carlos      1963.66        2802.98
9     Amazon         Fabio      7480.24        1841.75

In [4]:
df_01.groupby('Empresas').sum(numeric_only=True)
# Soma por empresa

           Valor_venda  Valor_imposto
Empresas
Amazon        14782.48        2875.13
Apple         11560.12        2800.90
Facebook       8971.31        3923.54
Google        16775.06        3741.94
Microsoft     15027.87        4083.73

In [5]:
df_01.groupby('Empresas').mean(numeric_only=True)
# Média de venda por empresa

           Valor_venda  Valor_imposto
Empresas
Amazon        7391.240       1437.565
Apple         5780.060       1400.450
Facebook      4485.655       1961.770
Google        8387.530       1870.970
Microsoft     7513.935       2041.865

In [6]:
df_01.groupby('Nome_vendedor').sum(numeric_only=True)
# Soma por vendero

               Valor_venda  Valor_imposto
Nome_vendedor
Carlos            15140.96        6374.86
Fabio              7480.24        1841.75
José              22725.20        4480.37
Maria             21770.44        4728.26

In [7]:
df_01.groupby('Empresas').describe()

          Valor_venda                                                       \
                count      mean          std      min        25%       50%
Empresas
Amazon            2.0  7391.240   125.865007  7302.24  7346.7400  7391.240
Apple             2.0  5780.060  2087.676203  4303.85  5041.9550  5780.060
Facebook          2.0  4485.655  3566.639533  1963.66  3224.6575  4485.655
Google            2.0  8387.530  4279.650656  5361.36  6874.4450  8387.530
Microsoft         2.0  7513.935   427.099567  7211.93  7362.9325  7513.935

                               Valor_imposto                                  \
                 75%       max         count      mean          std      min
Empresas
Amazon     7435.7400   7480.24           2.0  1437.565   571.603909  1033.38
Apple      6518.1650   7256.27           2.0  1400.450   275.700934  1205.50
Facebook   5746.6525   7007.65           2.0  1961.770  1189.650591  1120.56
Google     9900.6150  11413.70           2.0  1870.970   150.698597  1764.41
Microsoft  7664.9375   7815.94           2.0  2041.865   632.881782  1594.35


                 25%       50%        75%      max
Empresas
Amazon     1235.4725  1437.565  1639.6575  1841.75
Apple      1302.9750  1400.450  1497.9250  1595.40
Facebook   1541.1650  1961.770  2382.3750  2802.98
Google     1817.6900  1870.970  1924.2500  1977.53
Microsoft  1818.1075  2041.865  2265.6225  2489.38

### Juntar DFs

In [16]:

dados1 = {
    'reg_venda': [i for i in range(10,0,-1)],
    'empresas': ['Google', 'Apple', 'Microsoft', 'Facebook', 'Amazon', 'Google', 'Apple', 'Microsoft', 'Facebook', 'Amazon'],
    'nome_vendedor': [ 'José', 'Maria', 'Carlos', 'José', 'Maria', 'Carlos', 'José', 'Maria', 'Carlos', 'Fabio'],
    'valor_venda': [round((i+3)*2000, 2) for i in randn(10)],
    'valor_imposto': [round((i+3)*500, 2) for i in randn(10)],
}

dados_complemento1 = {
    'reg_venda': [i for i in range(10,0,-1)],
    'loja': ['l1', 'l2', 'l3', 'l1', 'l1', 'l4', 'l2', 'l1', 'l3', 'l1'],
    'nome_gerente': [ 'José', 'José', 'José', 'José', 'Maria', 'Carlos', 'Carlos', 'Carlos', 'Carlos', 'Carlos'],
    'itens_venda': [round((i+3), 0) for i in randn(10)],
    'valor_comissao': [round((i+3)*56, 2) for i in randn(10)],
}

dados2 = {
    'empresas': ['Samsung', 'Dell', 'Microsoft', 'HP', 'Samsung', 'Dell', 'Apple', 'Microsoft', 'HP', 'HP'],
    'nome_vendedor': [ 'Kelvin', 'Kelvin', 'Nando', 'Nando', 'Nando', 'Thiago', 'Thiago', 'Paty', 'Thiago', 'Kelvin'],
    'valor_venda': [round((i+3)*2000, 2) for i in randn(10)],
    'valor_imposto': [round((i+3)*500, 2) for i in randn(10)],
}

In [23]:
df01 = pd.DataFrame(dados1)
df02 = pd.DataFrame(dados2)
df03 = pd.DataFrame(dados_complemento1)

In [24]:
df01

   reg_venda   empresas nome_vendedor  valor_venda  valor_imposto
0         10     Google          José      3064.97        1215.71
1          9      Apple         Maria      5011.81        2203.67
2          8  Microsoft        Carlos      5674.93        1820.90
3          7   Facebook          José      6971.62        1047.45
4          6     Amazon         Maria      6784.98        1304.42
5          5     Google        Carlos      6442.98        2014.15
6          4      Apple          José      4289.61         513.70
7          3  Microsoft         Maria      9083.98        1066.56
8          2   Facebook        Carlos      7332.64        1860.39
9          1     Amazon         Fabio      4923.53         888.46

In [25]:
df02

    empresas nome_vendedor  valor_venda  valor_imposto
0    Samsung        Kelvin      7173.69        1864.51
1       Dell        Kelvin      2757.30        1068.45
2  Microsoft         Nando      7355.07        1652.82
3         HP         Nando      6052.21        1621.59
4    Samsung         Nando      2643.43        1932.08
5       Dell        Thiago      6667.95         719.53
6      Apple        Thiago      4935.06        1374.05
7  Microsoft          Paty     10235.45        1210.94
8         HP        Thiago      6395.05        1618.50
9         HP        Kelvin     10605.97        1600.39

In [19]:
df03

   reg_venda loja nome_gerente  itens_venda  valor_comissao
0         10   l1         José          5.0          204.35
1          9   l2         José          2.0          188.10
2          8   l3         José          2.0          107.49
3          7   l1         José          2.0          218.53
4          6   l1        Maria          3.0          177.06
5          5   l4       Carlos          3.0          214.65
6          4   l2       Carlos          2.0          222.64
7          3   l1       Carlos          3.0          146.26
8          2   l3       Carlos          2.0          211.87
9          1   l1       Carlos          3.0          128.30

### Concatenar Dataframes
concat()

In [26]:
df_concat_01 = pd.concat([df01, df02])
df_concat_01
# Usa os nomes das colunas para alinhar dos dados
# Não esqueça de resetar o index, caso não tenha criado com index
# Se o index não bater será preenchido com NaN

   reg_venda   empresas nome_vendedor  valor_venda  valor_imposto
0       10.0     Google          José      3064.97        1215.71
1        9.0      Apple         Maria      5011.81        2203.67
2        8.0  Microsoft        Carlos      5674.93        1820.90
3        7.0   Facebook          José      6971.62        1047.45
4        6.0     Amazon         Maria      6784.98        1304.42
5        5.0     Google        Carlos      6442.98        2014.15
6        4.0      Apple          José      4289.61         513.70
7        3.0  Microsoft         Maria      9083.98        1066.56
8        2.0   Facebook        Carlos      7332.64        1860.39
9        1.0     Amazon         Fabio      4923.53         888.46
0        NaN    Samsung        Kelvin      7173.69        1864.51
1        NaN       Dell        Kelvin      2757.30        1068.45
2        NaN  Microsoft         Nando      7355.07        1652.82
3        NaN         HP         Nando      6052.21        1621.59
4        NaN    Samsung         Nando      2643.43        1932.08
5        NaN       Dell        Thiago      6667.95         719.53
6        NaN      Apple        Thiago      4935.06        1374.05
7        NaN  Microsoft          Paty     10235.45        1210.94
8        NaN         HP        Thiago      6395.05        1618.50
9        NaN         HP        Kelvin     10605.97        1600.39

In [27]:
df_concat_02 = pd.concat([df01, df02], axis=1)
df_concat_02
# Funciona por conta do INDEX
# Se o index não bater será preenchido com NaN

,reg_venda,empresas,nome_vendedor,valor_venda,valor_imposto,empresas,nome_vendedor,valor_venda,valor_imposto
0,10,Google,José,3064.97,1215.71,Samsung,Kelvin,7173.69,1864.51
1,9,Apple,Maria,5011.81,2203.67,Dell,Kelvin,2757.30,1068.45
2,8,Microsoft,Carlos,5674.93,1820.90,Microsoft,Nando,7355.07,1652.82
3,7,Facebook,José,6971.62,1047.45,HP,Nando,6052.21,1621.59
4,6,Amazon,Maria,6784.98,1304.42,Samsung,Nando,2643.43,1932.08
5,5,Google,Carlos,6442.98,2014.15,Dell,Thiago,6667.95,719.53
6,4,Apple,José,4289.61,513.70,Apple,Thiago,4935.06,1374.05
7,3,Microsoft,Maria,9083.98,1066.56,Microsoft,Paty,10235.45,1210.94
8,2,Facebook,Carlos,7332.64,1860.39,HP,Thiago,6395.05,1618.50
9,1,Amazon,Fabio,4923.53,888.46,HP,Kelvin,10605.97,1600.39

### Mesclar DF
merge()

In [29]:
df_merge_01 = pd.merge(df01, df03, on=['reg_venda', 'reg_venda'])
df_merge_01

# Mesclar de forma direta onde o valor é exatamente o mesmo entre as chaves

,reg_venda,empresas,nome_vendedor,valor_venda,valor_imposto,loja,nome_gerente,itens_venda,valor_comissao
0,10,Google,José,3064.97,1215.71,l1,José,5.0,204.35
1,9,Apple,Maria,5011.81,2203.67,l2,José,2.0,188.10
2,8,Microsoft,Carlos,5674.93,1820.90,l3,José,2.0,107.49
3,7,Facebook,José,6971.62,1047.45,l1,José,2.0,218.53
4,6,Amazon,Maria,6784.98,1304.42,l1,Maria,3.0,177.06
5,5,Google,Carlos,6442.98,2014.15,l4,Carlos,3.0,214.65
6,4,Apple,José,4289.61,513.70,l2,Carlos,2.0,222.64
7,3,Microsoft,Maria,9083.98,1066.56,l1,Carlos,3.0,146.26
8,2,Facebook,Carlos,7332.64,1860.39,l3,Carlos,2.0,211.87
9,1,Amazon,Fabio,4923.53,888.46,l1,Carlos,3.0,128.30

In [31]:
dados_complemento2 = {
    'reg_venda': [i for i in range(10,1,-1)],
    'loja': ['l1', 'l2', 'l3', 'l1', 'l1', 'l4', 'l2', 'l1', 'l3'],
    'nome_gerente': [ 'José', 'José', 'José', 'José', 'Maria', 'Carlos', 'Carlos', 'Carlos', 'Carlos'],
    'itens_venda': [round((i+3), 0) for i in randn(9)],
    'valor_comissao': [round((i+3)*56, 2) for i in randn(9)],
}
df04 = pd.DataFrame(dados_complemento2)

In [32]:
df_merge_02 = pd.merge(df01, df04, on=['reg_venda', 'reg_venda'])
df_merge_02

#Default

,reg_venda,empresas,nome_vendedor,valor_venda,valor_imposto,loja,nome_gerente,itens_venda,valor_comissao
0,10,Google,José,3064.97,1215.71,l1,José,3.0,253.26
1,9,Apple,Maria,5011.81,2203.67,l2,José,3.0,177.97
2,8,Microsoft,Carlos,5674.93,1820.90,l3,José,3.0,132.90
3,7,Facebook,José,6971.62,1047.45,l1,José,4.0,146.10
4,6,Amazon,Maria,6784.98,1304.42,l1,Maria,2.0,265.63
5,5,Google,Carlos,6442.98,2014.15,l4,Carlos,1.0,231.28
6,4,Apple,José,4289.61,513.70,l2,Carlos,3.0,218.28
7,3,Microsoft,Maria,9083.98,1066.56,l1,Carlos,1.0,186.53
8,2,Facebook,Carlos,7332.64,1860.39,l3,Carlos,0.0,108.47

In [33]:
df_merge_02 = pd.merge(df01, df04, on=['reg_venda', 'reg_venda'], how='inner')
df_merge_02

# inner

,reg_venda,empresas,nome_vendedor,valor_venda,valor_imposto,loja,nome_gerente,itens_venda,valor_comissao
0,10,Google,José,3064.97,1215.71,l1,José,3.0,253.26
1,9,Apple,Maria,5011.81,2203.67,l2,José,3.0,177.97
2,8,Microsoft,Carlos,5674.93,1820.90,l3,José,3.0,132.90
3,7,Facebook,José,6971.62,1047.45,l1,José,4.0,146.10
4,6,Amazon,Maria,6784.98,1304.42,l1,Maria,2.0,265.63
5,5,Google,Carlos,6442.98,2014.15,l4,Carlos,1.0,231.28
6,4,Apple,José,4289.61,513.70,l2,Carlos,3.0,218.28
7,3,Microsoft,Maria,9083.98,1066.56,l1,Carlos,1.0,186.53
8,2,Facebook,Carlos,7332.64,1860.39,l3,Carlos,0.0,108.47

In [34]:
df_merge_02 = pd.merge(df01, df04, on=['reg_venda', 'reg_venda'], how='outer')
df_merge_02

# outer

,reg_venda,empresas,nome_vendedor,valor_venda,valor_imposto,loja,nome_gerente,itens_venda,valor_comissao
0,10,Google,José,3064.97,1215.71,l1,José,3.0,253.26
1,9,Apple,Maria,5011.81,2203.67,l2,José,3.0,177.97
2,8,Microsoft,Carlos,5674.93,1820.90,l3,José,3.0,132.90
3,7,Facebook,José,6971.62,1047.45,l1,José,4.0,146.10
4,6,Amazon,Maria,6784.98,1304.42,l1,Maria,2.0,265.63
5,5,Google,Carlos,6442.98,2014.15,l4,Carlos,1.0,231.28
6,4,Apple,José,4289.61,513.70,l2,Carlos,3.0,218.28
7,3,Microsoft,Maria,9083.98,1066.56,l1,Carlos,1.0,186.53
8,2,Facebook,Carlos,7332.64,1860.39,l3,Carlos,0.0,108.47
9,1,Amazon,Fabio,4923.53,888.46,NaN,NaN,NaN,NaN

In [35]:
df_merge_02 = pd.merge(df01, df04, on=['reg_venda', 'reg_venda'], how='left')
df_merge_02

# left

,reg_venda,empresas,nome_vendedor,valor_venda,valor_imposto,loja,nome_gerente,itens_venda,valor_comissao
0,10,Google,José,3064.97,1215.71,l1,José,3.0,253.26
1,9,Apple,Maria,5011.81,2203.67,l2,José,3.0,177.97
2,8,Microsoft,Carlos,5674.93,1820.90,l3,José,3.0,132.90
3,7,Facebook,José,6971.62,1047.45,l1,José,4.0,146.10
4,6,Amazon,Maria,6784.98,1304.42,l1,Maria,2.0,265.63
5,5,Google,Carlos,6442.98,2014.15,l4,Carlos,1.0,231.28
6,4,Apple,José,4289.61,513.70,l2,Carlos,3.0,218.28
7,3,Microsoft,Maria,9083.98,1066.56,l1,Carlos,1.0,186.53
8,2,Facebook,Carlos,7332.64,1860.39,l3,Carlos,0.0,108.47
9,1,Amazon,Fabio,4923.53,888.46,NaN,NaN,NaN,NaN

In [36]:
df_merge_02 = pd.merge(df01, df04, on=['reg_venda', 'reg_venda'], how='right')
df_merge_02

# right

,reg_venda,empresas,nome_vendedor,valor_venda,valor_imposto,loja,nome_gerente,itens_venda,valor_comissao
0,10,Google,José,3064.97,1215.71,l1,José,3.0,253.26
1,9,Apple,Maria,5011.81,2203.67,l2,José,3.0,177.97
2,8,Microsoft,Carlos,5674.93,1820.90,l3,José,3.0,132.90
3,7,Facebook,José,6971.62,1047.45,l1,José,4.0,146.10
4,6,Amazon,Maria,6784.98,1304.42,l1,Maria,2.0,265.63
5,5,Google,Carlos,6442.98,2014.15,l4,Carlos,1.0,231.28
6,4,Apple,José,4289.61,513.70,l2,Carlos,3.0,218.28
7,3,Microsoft,Maria,9083.98,1066.56,l1,Carlos,1.0,186.53
8,2,Facebook,Carlos,7332.64,1860.39,l3,Carlos,0.0,108.47

In [37]:
# Especificando a coluna de outra forma
df_merge_02 = pd.merge(df01, df04, right_on='reg_venda', left_on='reg_venda', how='left')
df_merge_02

# left

,reg_venda,empresas,nome_vendedor,valor_venda,valor_imposto,loja,nome_gerente,itens_venda,valor_comissao
0,10,Google,José,3064.97,1215.71,l1,José,3.0,253.26
1,9,Apple,Maria,5011.81,2203.67,l2,José,3.0,177.97
2,8,Microsoft,Carlos,5674.93,1820.90,l3,José,3.0,132.90
3,7,Facebook,José,6971.62,1047.45,l1,José,4.0,146.10
4,6,Amazon,Maria,6784.98,1304.42,l1,Maria,2.0,265.63
5,5,Google,Carlos,6442.98,2014.15,l4,Carlos,1.0,231.28
6,4,Apple,José,4289.61,513.70,l2,Carlos,3.0,218.28
7,3,Microsoft,Maria,9083.98,1066.56,l1,Carlos,1.0,186.53
8,2,Facebook,Carlos,7332.64,1860.39,l3,Carlos,0.0,108.47
9,1,Amazon,Fabio,4923.53,888.46,NaN,NaN,NaN,NaN

### JOIN
join()

join é um método do df


Para o join NECESSITA do INDEX

In [69]:
df05 = df04[df04['reg_venda'] % 2 == 0].copy()
df05.set_index('reg_venda')
df06 = df05.copy()
df06['reg_venda'] = df06['reg_venda'].apply(lambda x: x*2)
df06['valor_comissao'] = df06['valor_comissao'].apply(lambda x: x*2)
df07 = pd.concat([df05, df06])
df07

   reg_venda loja nome_gerente  itens_venda  valor_comissao
0         10   l1         José          3.0          253.26
2          8   l3         José          3.0          132.90
4          6   l1        Maria          2.0          265.63
6          4   l2       Carlos          3.0          218.28
8          2   l3       Carlos          0.0          108.47
0         20   l1         José          3.0          506.52
2         16   l3         José          3.0          265.80
4         12   l1        Maria          2.0          531.26
6          8   l2       Carlos          3.0          436.56
8          4   l3       Carlos          0.0          216.94

In [70]:
df_join_01 = df01.set_index('reg_venda').join(df05)
df_join_01

,empresas,nome_vendedor,valor_venda,valor_imposto,reg_venda,loja,nome_gerente,itens_venda,valor_comissao
reg_venda,,,,,,,,,
10,Google,José,3064.97,1215.71,NaN,NaN,NaN,NaN,NaN
9,Apple,Maria,5011.81,2203.67,NaN,NaN,NaN,NaN,NaN
8,Microsoft,Carlos,5674.93,1820.90,2.0,l3,Carlos,0.0,108.47
7,Facebook,José,6971.62,1047.45,NaN,NaN,NaN,NaN,NaN
6,Amazon,Maria,6784.98,1304.42,4.0,l2,Carlos,3.0,218.28
5,Google,Carlos,6442.98,2014.15,NaN,NaN,NaN,NaN,NaN
4,Apple,José,4289.61,513.70,6.0,l1,Maria,2.0,265.63
3,Microsoft,Maria,9083.98,1066.56,NaN,NaN,NaN,NaN,NaN
2,Facebook,Carlos,7332.64,1860.39,8.0,l3,José,3.0,132.90
1,Amazon,Fabio,4923.53,888.46,NaN,NaN,NaN,NaN,NaN

In [71]:
df_join_02 = df01.set_index('reg_venda').join(df07, how='outer')
df_join_02

,empresas,nome_vendedor,valor_venda,valor_imposto,reg_venda,loja,nome_gerente,itens_venda,valor_comissao
0,NaN,NaN,NaN,NaN,10.0,l1,José,3.0,253.26
0,NaN,NaN,NaN,NaN,20.0,l1,José,3.0,506.52
1,Amazon,Fabio,4923.53,888.46,NaN,NaN,NaN,NaN,NaN
2,Facebook,Carlos,7332.64,1860.39,8.0,l3,José,3.0,132.90
2,Facebook,Carlos,7332.64,1860.39,16.0,l3,José,3.0,265.80
3,Microsoft,Maria,9083.98,1066.56,NaN,NaN,NaN,NaN,NaN
4,Apple,José,4289.61,513.70,6.0,l1,Maria,2.0,265.63
4,Apple,José,4289.61,513.70,12.0,l1,Maria,2.0,531.26
5,Google,Carlos,6442.98,2014.15,NaN,NaN,NaN,NaN,NaN
6,Amazon,Maria,6784.98,1304.42,4.0,l2,Carlos,3.0,218.28
6,Amazon,Maria,6784.98,1304.42,8.0,l2,Carlos,3.0,436.56
7,Facebook,José,6971.62,1047.45,NaN,NaN,NaN,NaN,NaN
8,Microsoft,Carlos,5674.93,1820.90,2.0,l3,Carlos,0.0,108.47
8,Microsoft,Carlos,5674.93,1820.90,4.0,l3,Carlos,0.0,216.94
9,Apple,Maria,5011.81,2203.67,NaN,NaN,NaN,NaN,NaN
10,Google,José,3064.97,1215.71,NaN,NaN,NaN,NaN,NaN

## Outras operações corriqueiras no pandas

unique()

In [72]:
df08 = df_join_02.copy()

In [73]:
df08['empresas'].unique()

array([nan, 'Amazon', 'Facebook', 'Microsoft', 'Apple', 'Google'],
      dtype=object)

In [74]:
df08['nome_gerente'].unique()

array(['José', nan, 'Maria', 'Carlos'], dtype=object)

In [75]:
df08.nunique()

# pd.DataFrame não tem o método unique() mas tem o nunique()

empresas           5
nome_vendedor      4
valor_venda       10
valor_imposto     10
reg_venda          8
loja               3
nome_gerente       3
itens_venda        3
valor_comissao    10
dtype: int64

In [76]:
df08['nome_gerente'].nunique()

# Contagem de valores de gerentes unicos (Não contabiliza o NaN)

3

In [77]:
df08['empresas'].nunique()

# Não conta o NaN

5

In [78]:
df08['empresas'].value_counts()
# Realiza a contagem de unicos

Amazon       3
Facebook     3
Microsoft    3
Apple        3
Google       2
Name: empresas, dtype: int64

In [83]:
df08.value_counts()
# um belo resumo do dataframe.

empresas   nome_vendedor  valor_venda  valor_imposto  reg_venda  loja  nome_gerente  itens_venda  valor_comissao
Amazon     Maria          6784.98      1304.42        4.0        l2    Carlos        3.0          218.28            1
                                                      8.0        l2    Carlos        3.0          436.56            1
Apple      José           4289.61      513.70         6.0        l1    Maria         2.0          265.63            1
                                                      12.0       l1    Maria         2.0          531.26            1
Facebook   Carlos         7332.64      1860.39        8.0        l3    José          3.0          132.90            1
                                                      16.0       l3    José          3.0          265.80            1
Microsoft  Carlos         5674.93      1820.90        2.0        l3    Carlos        0.0          108.47            1
                                                      4.0        l3    Carlos        0.0          216.94            1
dtype: int64

In [81]:
df08

,empresas,nome_vendedor,valor_venda,valor_imposto,reg_venda,loja,nome_gerente,itens_venda,valor_comissao
0,NaN,NaN,NaN,NaN,10.0,l1,José,3.0,253.26
0,NaN,NaN,NaN,NaN,20.0,l1,José,3.0,506.52
1,Amazon,Fabio,4923.53,888.46,NaN,NaN,NaN,NaN,NaN
2,Facebook,Carlos,7332.64,1860.39,8.0,l3,José,3.0,132.90
2,Facebook,Carlos,7332.64,1860.39,16.0,l3,José,3.0,265.80
3,Microsoft,Maria,9083.98,1066.56,NaN,NaN,NaN,NaN,NaN
4,Apple,José,4289.61,513.70,6.0,l1,Maria,2.0,265.63
4,Apple,José,4289.61,513.70,12.0,l1,Maria,2.0,531.26
5,Google,Carlos,6442.98,2014.15,NaN,NaN,NaN,NaN,NaN
6,Amazon,Maria,6784.98,1304.42,4.0,l2,Carlos,3.0,218.28
6,Amazon,Maria,6784.98,1304.42,8.0,l2,Carlos,3.0,436.56
7,Facebook,José,6971.62,1047.45,NaN,NaN,NaN,NaN,NaN
8,Microsoft,Carlos,5674.93,1820.90,2.0,l3,Carlos,0.0,108.47
8,Microsoft,Carlos,5674.93,1820.90,4.0,l3,Carlos,0.0,216.94
9,Apple,Maria,5011.81,2203.67,NaN,NaN,NaN,NaN,NaN
10,Google,José,3064.97,1215.71,NaN,NaN,NaN,NaN,NaN

### Ordenar dataframe
sort_values()

Também afetado pelo INPLACE

In [84]:
df08.sort_values(by='valor_comissao')

# Modo Default Crescente.

,empresas,nome_vendedor,valor_venda,valor_imposto,reg_venda,loja,nome_gerente,itens_venda,valor_comissao
8,Microsoft,Carlos,5674.93,1820.90,2.0,l3,Carlos,0.0,108.47
2,Facebook,Carlos,7332.64,1860.39,8.0,l3,José,3.0,132.90
8,Microsoft,Carlos,5674.93,1820.90,4.0,l3,Carlos,0.0,216.94
6,Amazon,Maria,6784.98,1304.42,4.0,l2,Carlos,3.0,218.28
0,NaN,NaN,NaN,NaN,10.0,l1,José,3.0,253.26
4,Apple,José,4289.61,513.70,6.0,l1,Maria,2.0,265.63
2,Facebook,Carlos,7332.64,1860.39,16.0,l3,José,3.0,265.80
6,Amazon,Maria,6784.98,1304.42,8.0,l2,Carlos,3.0,436.56
0,NaN,NaN,NaN,NaN,20.0,l1,José,3.0,506.52
4,Apple,José,4289.61,513.70,12.0,l1,Maria,2.0,531.26
1,Amazon,Fabio,4923.53,888.46,NaN,NaN,NaN,NaN,NaN
3,Microsoft,Maria,9083.98,1066.56,NaN,NaN,NaN,NaN,NaN
5,Google,Carlos,6442.98,2014.15,NaN,NaN,NaN,NaN,NaN
7,Facebook,José,6971.62,1047.45,NaN,NaN,NaN,NaN,NaN
9,Apple,Maria,5011.81,2203.67,NaN,NaN,NaN,NaN,NaN
10,Google,José,3064.97,1215.71,NaN,NaN,NaN,NaN,NaN

In [86]:
df08.sort_values(by='valor_comissao', ascending=False)
# Ordenação de forma decrescente.

,empresas,nome_vendedor,valor_venda,valor_imposto,reg_venda,loja,nome_gerente,itens_venda,valor_comissao
4,Apple,José,4289.61,513.70,12.0,l1,Maria,2.0,531.26
0,NaN,NaN,NaN,NaN,20.0,l1,José,3.0,506.52
6,Amazon,Maria,6784.98,1304.42,8.0,l2,Carlos,3.0,436.56
2,Facebook,Carlos,7332.64,1860.39,16.0,l3,José,3.0,265.80
4,Apple,José,4289.61,513.70,6.0,l1,Maria,2.0,265.63
0,NaN,NaN,NaN,NaN,10.0,l1,José,3.0,253.26
6,Amazon,Maria,6784.98,1304.42,4.0,l2,Carlos,3.0,218.28
8,Microsoft,Carlos,5674.93,1820.90,4.0,l3,Carlos,0.0,216.94
2,Facebook,Carlos,7332.64,1860.39,8.0,l3,José,3.0,132.90
8,Microsoft,Carlos,5674.93,1820.90,2.0,l3,Carlos,0.0,108.47
1,Amazon,Fabio,4923.53,888.46,NaN,NaN,NaN,NaN,NaN
3,Microsoft,Maria,9083.98,1066.56,NaN,NaN,NaN,NaN,NaN
5,Google,Carlos,6442.98,2014.15,NaN,NaN,NaN,NaN,NaN
7,Facebook,José,6971.62,1047.45,NaN,NaN,NaN,NaN,NaN
9,Apple,Maria,5011.81,2203.67,NaN,NaN,NaN,NaN,NaN
10,Google,José,3064.97,1215.71,NaN,NaN,NaN,NaN,NaN

### Checagem de valores nulos
isnull()

In [87]:
df08.isnull()

# retorna um DF boleano, bom para filtros

,empresas,nome_vendedor,valor_venda,valor_imposto,reg_venda,loja,nome_gerente,itens_venda,valor_comissao
0,True,True,True,True,False,False,False,False,False
0,True,True,True,True,False,False,False,False,False
1,False,False,False,False,True,True,True,True,True
2,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,True,True,True,True,True
4,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
5,False,False,False,False,True,True,True,True,True
6,False,False,False,False,False,False,False,False,False
6,False,False,False,False,False,False,False,False,False
7,False,False,False,False,True,True,True,True,True
8,False,False,False,False,False,False,False,False,False
8,False,False,False,False,False,False,False,False,False
9,False,False,False,False,True,True,True,True,True
10,False,False,False,False,True,True,True,True,True

In [89]:
df08.isna()

# Retorna um DF boleano, bom para filtros.

,empresas,nome_vendedor,valor_venda,valor_imposto,reg_venda,loja,nome_gerente,itens_venda,valor_comissao
0,True,True,True,True,False,False,False,False,False
0,True,True,True,True,False,False,False,False,False
1,False,False,False,False,True,True,True,True,True
2,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,True,True,True,True,True
4,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
5,False,False,False,False,True,True,True,True,True
6,False,False,False,False,False,False,False,False,False
6,False,False,False,False,False,False,False,False,False
7,False,False,False,False,True,True,True,True,True
8,False,False,False,False,False,False,False,False,False
8,False,False,False,False,False,False,False,False,False
9,False,False,False,False,True,True,True,True,True
10,False,False,False,False,True,True,True,True,True

In [90]:
df08.head()

# Mosta as primeiras linhas de um DF

,empresas,nome_vendedor,valor_venda,valor_imposto,reg_venda,loja,nome_gerente,itens_venda,valor_comissao
0,NaN,NaN,NaN,NaN,10.0,l1,José,3.0,253.26
0,NaN,NaN,NaN,NaN,20.0,l1,José,3.0,506.52
1,Amazon,Fabio,4923.53,888.46,NaN,NaN,NaN,NaN,NaN
2,Facebook,Carlos,7332.64,1860.39,8.0,l3,José,3.0,132.90
2,Facebook,Carlos,7332.64,1860.39,16.0,l3,José,3.0,265.80

## Pivot_table
A tabela dinamica do excel, muito mais poderosa.
pivot_table()

In [95]:
df08_pivot = pd.pivot_table(df08, values=['valor_venda', 'valor_comissao'], index=['nome_gerente', 'empresas'], columns='loja').fillna(0)
df08_pivot


# Note o fillna() no final, pois pivot_table retorna NaN para casos de não localização

                       valor_comissao                  valor_venda           \
loja                               l1      l2       l3          l1       l2
nome_gerente empresas
Carlos       Amazon             0.000  327.42    0.000        0.00  6784.98
             Microsoft          0.000    0.00  162.705        0.00     0.00
José         Facebook           0.000    0.00  199.350        0.00     0.00
Maria        Apple            398.445    0.00    0.000     4289.61     0.00


loja                         l3
nome_gerente empresas
Carlos       Amazon        0.00
             Microsoft  5674.93
José         Facebook   7332.64
Maria        Apple         0.00

## Leitura de dados

read_csv()
read_exce()
read_html()